In [1]:
import sqlite3
from sqlite3 import Error

 
def create_connection(db_file):
    """ create a database connection to the SQLite database
        specified by the db_file
    :param db_file: database file
    :return: Connection object or None
    """
    conn = None
    try:
        conn = sqlite3.connect(db_file)
        print(sqlite3.version)
    except Error as e:
        print(e)
 
    return conn

 
def select_all_tasks(conn):
    """
    Query all rows in the tasks table
    :param conn: the Connection object
    :return:
    """
    cur = conn.cursor()
    
    query1 = """
        SELECT *
        FROM FACILITIES
        """
    cur.execute(query1)
 
    rows = cur.fetchall()
 
    for row in rows:
        print(row)


def main():
    database = "sqlite_db_pythonsqlite.db"
 
    # create a database connection
    conn = create_connection(database)
    with conn: 
        print("2. Query all tasks")
        select_all_tasks(conn)
 
 
if __name__ == '__main__':
    main()

2.6.0
2. Query all tasks
(0, 'Tennis Court 1', 5, 25, 10000, 200)
(1, 'Tennis Court 2', 5, 25, 8000, 200)
(2, 'Badminton Court', 0, 15.5, 4000, 50)
(3, 'Table Tennis', 0, 5, 320, 10)
(4, 'Massage Room 1', 9.9, 80, 4000, 3000)
(5, 'Massage Room 2', 9.9, 80, 4000, 3000)
(6, 'Squash Court', 3.5, 17.5, 5000, 80)
(7, 'Snooker Table', 0, 5, 450, 15)
(8, 'Pool Table', 0, 5, 400, 15)

QUESTIONS:
/* Q10: Produce a list of facilities with a total revenue less than 1000.
The output of facility name and total revenue, sorted by revenue. Remember
that there's a different cost for guests and members! */

In [2]:
def main():
    database = "sqlite_db_pythonsqlite.db"
 
    # create a database connection
    conn = create_connection(database)
    with conn: 
        print("2. Query all tasks")
        select_all_tasks(conn)

In [3]:
def create_connection(db_file):
    """ create a database connection to the SQLite database
        specified by the db_file
    :param db_file: database file
    :return: Connection object or None
    """
    conn = None
    try:
        conn = sqlite3.connect(db_file)
        print(sqlite3.version)
    except Error as e:
        print(e)
 
    return conn

In [4]:
def select_all_tasks(conn, query1):
    """
    Query all rows in the tasks table
    :param conn: the Connection object
    :return:
    """
    cur = conn.cursor()
    
   
    cur.execute(query1)
 
    rows = cur.fetchall()
 
    for row in rows:
        print(row)

In [7]:
database = "sqlite_db_pythonsqlite.db"
conn = create_connection(database)
select_all_tasks( conn, """SELECT f.name as facility,f.facid,
sum(case when b.memid = 0 then guestcost end) as guest_total,
sum(case when b.memid != 0 then membercost end) as member_total
FROM `Bookings` as b 
left join `Facilities` as f on b.facid=f.facid
group by facility """)

2.6.0
('Badminton Court', 2, 604.5, 0)
('Massage Room 1', 4, 16640, 4167.900000000023)
('Massage Room 2', 5, 6720, 267.30000000000007)
('Pool Table', 8, 265, 0)
('Snooker Table', 7, 115, 0)
('Squash Court', 6, 4287.5, 682.5)
('Table Tennis', 3, 90, 0)
('Tennis Court 1', 0, 2500, 1540)
('Tennis Court 2', 1, 2825, 1380)

# /* Q10: Produce a list of facilities with a total revenue less than 1000.
# The output of facility name and total revenue, sorted by revenue. Remember
# that there's a different cost for guests and members! */

In [8]:
# /* Q10: Produce a list of facilities with a total revenue less than 1000.
# The output of facility name and total revenue, sorted by revenue. Remember
# that there's a different cost for guests and members! */


select_all_tasks( conn, """with t as (SELECT f.name as facility,f.facid,
sum(case when b.memid = 0 then guestcost end) as guest_total,
sum(case when b.memid != 0 then membercost end) as member_total
FROM `Bookings` as b 
left join `Facilities` as f on b.facid=f.facid
group by facility) 
select facility,(guest_total+ member_total) as total_revenue
from t 
where total_revenue < 1000
order by total_revenue""")

('Table Tennis', 90)
('Snooker Table', 115)
('Pool Table', 265)
('Badminton Court', 604.5)

# /* Q11: Produce a report of members and who recommended them in alphabetic surname,firstname order */

In [9]:
# /* Q11: Produce a report of members and who recommended them in alphabetic surname,firstname order */


select_all_tasks( conn, """
with m1 as ( select firstname,surname,memid,recommendedby from `Members`),
m2 as ( select firstname,surname,memid,recommendedby from `Members`)
select m2.memid, m2.firstname, m2.surname,m2.recommendedby,m1.firstname, m1.surname
from m1
join m2
on m1.memid = m2.recommendedby
order by m2.surname, m2.firstname

""")

(15, 'Florence', 'Bader', '9', 'Ponder', 'Stibbons')
(12, 'Anne', 'Baker', '9', 'Ponder', 'Stibbons')
(16, 'Timothy', 'Baker', '13', 'Jemima', 'Farrell')
(8, 'Tim', 'Boothe', '3', 'Tim', 'Rownam')
(5, 'Gerald', 'Butters', '1', 'Darren', 'Smith')
(22, 'Joan', 'Coplin', '16', 'Timothy', 'Baker')
(36, 'Erica', 'Crumpet', '2', 'Tracy', 'Smith')
(7, 'Nancy', 'Dare', '4', 'Janice', 'Joplette')
(20, 'Matthew', 'Genting', '5', 'Gerald', 'Butters')
(35, 'John', 'Hunt', '30', 'Millicent', 'Purview')
(11, 'David', 'Jones', '4', 'Janice', 'Joplette')
(26, 'Douglas', 'Jones', '11', 'David', 'Jones')
(4, 'Janice', 'Joplette', '1', 'Darren', 'Smith')
(21, 'Anna', 'Mackenzie', '1', 'Darren', 'Smith')
(10, 'Charles', 'Owen', '1', 'Darren', 'Smith')
(17, 'David', 'Pinker', '13', 'Jemima', 'Farrell')
(30, 'Millicent', 'Purview', '2', 'Tracy', 'Smith')
(27, 'Henrietta', 'Rumney', '20', 'Matthew', 'Genting')
(24, 'Ramnaresh', 'Sarwin', '15', 'Florence', 'Bader')
(14, 'Jack', 'Smith', '1', 'Darren', 'Smith')
(9, 'Ponder', 'Stibbons', '6', 'Burton', 'Tracy')
(29, 'Henry', 'Worthington-Smyth', '2', 'Tracy', 'Smith')

# /* Q12: Find the facilities with their usage by member, but not guests */

In [12]:
select_all_tasks( conn,"""SELECT b.facid, COUNT( b.memid ) AS mem_usage, f.name
FROM (
SELECT facid, memid
FROM Bookings
WHERE memid !=0
) AS b
LEFT JOIN Facilities AS f ON b.facid = f.facid
GROUP BY b.facid""")

(0, 308, 'Tennis Court 1')
(1, 276, 'Tennis Court 2')
(2, 344, 'Badminton Court')
(3, 385, 'Table Tennis')
(4, 421, 'Massage Room 1')
(5, 27, 'Massage Room 2')
(6, 195, 'Squash Court')
(7, 421, 'Snooker Table')
(8, 783, 'Pool Table')


# /* Q13: Find the facilities usage by month, but not guests */

In [13]:
select_all_tasks( conn,"""SELECT b.months, COUNT( b.memid ) AS mem_usage
FROM (
SELECT strftime('%m', starttime ) AS months, memid
FROM Bookings
WHERE memid !=0
) AS b
GROUP BY b.months""")

('07', 480)
('08', 1168)
('09', 1512)

# test pandas_sql_query below

In [100]:
import pandas as pd 
from sqlalchemy import create_engine
engine = create_engine('sqlite:///sqlite_db_pythonsqlite.db')

df = pd.read_sql_query("select * from Members limit 10", engine)
df

,memid,surname,firstname,address,zipcode,telephone,recommendedby,joindate
0,0,GUEST,GUEST,GUEST,0,(000) 000-0000,,2012-07-01 00:00:00
1,1,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,,2012-07-02 12:02:05
2,2,Smith,Tracy,"8 Bloomsbury Close, New York",4321,555-555-5555,,2012-07-02 12:08:23
3,3,Rownam,Tim,"23 Highway Way, Boston",23423,(844) 693-0723,,2012-07-03 09:32:15
4,4,Joplette,Janice,"20 Crossing Road, New York",234,(833) 942-4710,1,2012-07-03 10:25:05
5,5,Butters,Gerald,"1065 Huntingdon Avenue, Boston",56754,(844) 078-4130,1,2012-07-09 10:44:09
6,6,Tracy,Burton,"3 Tunisia Drive, Boston",45678,(822) 354-9973,,2012-07-15 08:52:55
7,7,Dare,Nancy,"6 Hunting Lodge Way, Boston",10383,(833) 776-4001,4,2012-07-25 08:59:12
8,8,Boothe,Tim,"3 Bloomsbury Close, Reading, 00234",234,(811) 433-2547,3,2012-07-25 16:02:35
9,9,Stibbons,Ponder,"5 Dragons Way, Winchester",87630,(833) 160-3900,6,2012-07-25 17:09:05